#ifndef __LOG_H__
#define __LOG_H__

/*
 * При разработке классов следует придерживаться принятого формата имен:
 * 
 * local  - локальные переменные в методах или функциях
 * input_ - передаваемые параметры в методы класса
 * prop__ - свойства класса
 * 
 * Пример:
 * 
 * class A {
 * 
 *  private:
 *    int a__; //свойство класса A
 *    
 *    //методод класса A с входным параметром d_
 *    void func(int d_){
 *      int b; //локальная переменная
 *      b=d_;
 *      
 *    }
 * };
 * 
 */

class Log {
  
public: 
  
private:
  
  
};

#endif
